{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, 32], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "name": "input_0", "inbound_nodes": []}, {"class_name": "Conv2DTranspose", "config": {"name": "11", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": [0, 0]}, "name": "11", "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "12", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "12", "inbound_nodes": [[["11", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "17", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "bilinear"}, "name": "17", "inbound_nodes": [[["12", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "18", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": [0, 0]}, "name": "18", "inbound_nodes": [[["17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "19", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "19", "inbound_nodes": [[["18", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "20", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": [0, 0]}, "name": "20", "inbound_nodes": [[["19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "21", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "21", "inbound_nodes": [[["20", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "26", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "bilinear"}, "name": "26", "inbound_nodes": [[["21", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "27", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": [0, 0]}, "name": "27", "inbound_nodes": [[["26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "28", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "28", "inbound_nodes": [[["27", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "29", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": [0, 0]}, "name": "29", "inbound_nodes": [[["28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "output_0", "inbound_nodes": [[["29", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "11/kernel", "shape": [4, 4, 128, 32], "dtype": "float32"}, {"name": "11/bias", "shape": [128], "dtype": "float32"}, {"name": "18/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "18/bias", "shape": [64], "dtype": "float32"}, {"name": "20/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "20/bias", "shape": [64], "dtype": "float32"}, {"name": "27/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "27/bias", "shape": [32], "dtype": "float32"}, {"name": "29/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "29/bias", "shape": [1], "dtype": "float32"}]}]}