{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_6", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "name": "input_0", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "13", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "13", "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "14", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "14", "inbound_nodes": [[["13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "15", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "15", "inbound_nodes": [[["14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "16", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "16", "inbound_nodes": [[["15", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "17", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "17", "inbound_nodes": [[["16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "18", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "18", "inbound_nodes": [[["17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "19", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "19", "inbound_nodes": [[["18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "20", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "20", "inbound_nodes": [[["19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "21", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "21", "inbound_nodes": [[["20", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "22", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "22", "inbound_nodes": [[["21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "23", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "23", "inbound_nodes": [[["22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "24", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "24", "inbound_nodes": [[["23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output_0", "inbound_nodes": [[["24", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "13/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "13/bias", "shape": [32], "dtype": "float32"}, {"name": "15/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "15/bias", "shape": [64], "dtype": "float32"}, {"name": "18/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "18/bias", "shape": [64], "dtype": "float32"}, {"name": "20/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "20/bias", "shape": [128], "dtype": "float32"}, {"name": "23/kernel", "shape": [4, 4, 128, 1024], "dtype": "float32"}, {"name": "23/bias", "shape": [1024], "dtype": "float32"}, {"name": "output_0/kernel", "shape": [1, 1, 1024, 32], "dtype": "float32"}, {"name": "output_0/bias", "shape": [32], "dtype": "float32"}]}]}